БОДЛОГЫН ХОЛБООС: https://www.hackerrank.com/challenges/connected-cell-in-a-grid/problem?isFullScreen=true
БОДЛОГЫН ӨГҮҮЛБЭР: Танд n x m хэмжээтэй хоёр хэмжээст сүлжээ (grid) өгөгдсөн. Энэ сүлжээ нь зөвхөн 0 болон 1 гэсэн утгуудыг агуулна.
1 гэдэг нь тухайн эс (cell) "идэвхтэй" буюу нэг бүлэгт багтаж болно гэсэн үг. 0 гэдэг нь идэвхгүй эс бөгөөд холбогдсон эсүүдийн бүлэгт багтахгүй.
Идэвхтэй эсүүд (утга нь 1) шулуун (дээш, доош, зүүн, баруун) болон диагональ (налуу) чиглэлүүдээр хөрш эсүүдтэй холбогдож болно.
Хамгийн том холбогдсон эсүүдийн бүлгийн хэмжээ (эсийн тоо) хэд вэ?
Оролт: Эхний мөрөнд хоёр бүхэл тоо n, m (1 ≤ n, m ≤ 100) өгөгдөнө.
Дараагийн n мөр тус бүрт m ширхэг 0 эсвэл 1-ийн утгатай бүхэл тоонууд оршино.
Гаралт: Гаралтанд хамгийн олон эсээс бүрдсэн холбогдсон бүлгийн хэмжээ болох ганц бүхэл тоог хэвлэнэ.
Оролт:
4 4
1 1 0 0
0 1 1 0
0 0 1 0
1 0 0 0
Гаралт:
5
Доорх сүлжээг авч үзье:
1 1 0 0
0 1 1 0
0 0 1 0
1 0 0 0
1-үүд дараах байдлаар холбогдсон байна:

(0,0), (0,1), (1,1), (1,2), (2,2) гэсэн 5 эс нь холбогдсон бүлэг үүсгэж байна.
