БОДЛОГЫН ХОЛБООС: https://www.hackerrank.com/challenges/is-binary-search-tree/problem?isFullScreen=true

БОДЛОГЫН ӨГҮҮЛБЭР: 
Модны баруун мөчир (subtree) дэх бүх оройнуудын утга нь тухайн оройн утгаас их байх ёстой. Энэхүү дүрэм модны бүх түвшинд (оролт болгон) давтагддаг.
Ийм бүтэцтэй мод нь хайлтын үйлдлийг хурдасгах зориулалттай бөгөөд өгөгдлийг эрэмбэлж хадгалахад ашиглагддаг.
Өгөгдсөн модны бүтэц дээр тулгуурлан:
Модны бүх оройнууд дээрх BST-ийн дүрмүүд (зүүн мөчир нь бага, баруун мөчир нь их байх) биелэгдэж байгаа эсэхийг шалгах.
Хэрэв бүх дүрэм биелэж байвал “YES” гэж хэвлэ. Үгүй бол “NO” гэж хэвлэ.
Орж ирэх өгөгдөл
Модны оройнуудын тоо, мөн орой бүрийн утга, мөн тэдгээрийн зүүн, баруун хүүхдүүдийн индексүүд.
Гарсан үр дүн
“YES” эсвэл “NO”
