БОДЛОГЫН ХОЛБООС: https://www.hackerrank.com/challenges/countingsort4/problem?isFullScreen=true
БОДЛОГЫН ӨГҮҮЛБЭР: 
Чамд n ширхэг (x, s) хосолсон өгөгдөл өгөгдсөн ба энд x нь бүхэл тоо, s нь текст буюу үг байна. Эдгээр хослол нь 1-ээс эхэлсэн дугаарлагдсан жагсаалт юм.
Жагсаалтын эхний хагас буюу n/2 хүртэлх мөрүүдийн текст буюу s утгыг орлуулж, оронд нь "-" (түүний оронд үг байхгүйг заасан тэмдэг) тавина.
Дараа нь бүх мөрүүдийг x тоогоор эрэмбэлнэ (бүхэл тоо жижиг утгаас их утгын чиглэлд эрэмбэлнэ).
Эцэст нь эрэмбэлсний дараах дарааллаар мөрүүдийн текстүүдийг хооронд нь зайгаар тусгаарлан нэг мөр болгон хэвлэнэ.
