БОДЛОГЫН ХОЛБООС: https://www.hackerrank.com/challenges/magic-square-forming/problem?isFullScreen=true

БОДЛОГЫН ӨГҮҮЛБЭР:
Танд 1-ээс 9 хүртэлх бүхэл тоонуудыг агуулсан 3x3 хэмжээтэй матриц өгөгдөнө. Та тухайн матрицын аль ч a тоог өөр нэг b тоонд хөрвүүлж болох ба энэ үйлдлийн зардал нь |a - b| (a ба b тоонуудын ялгаврын абсолют утга) байна.
Таны зорилго бол өгөгдсөн матрицыг хамгийн бага зардлаар ид шидийн квадрат (magic square) болгон хувиргах явдал юм. Тэгээд гарсан хамгийн бага зардлыг хэвлэ.
Тайлбар: Ид шидийн квадрат гэдэг нь 3x3 хэмжээтэй, 1-ээс 9 хүртэлх ялгаатай бүхэл тоонуудыг агуулсан матриц бөгөөд матрицын бүх мөр, бүх багана, болон хоёул тэгш диагоналын нийлбэр ижил байх ёстой. 
Жишээ нь:
8 1 6
3 5 7
4 9 2
Энэ матрицын бүх мөр, багана, диагоналын нийлбэр 15 байна.
